package homework_3rd;

public class Ex04 {
	
//	다음 질문에 간단히 답하라. 
//	(1) 생성자는 어떤 용도로 쓰이는가? 
//	생성자는 객체를 선언함으로써 heap에 메모리를 할당하는 용도로 쓰인다.
	
//	(2) 중복 정의된 메소드들은 어떻게 구별되어서 호출되는가?
//	중복정의된 메소드는 패러미터를 달리 지정하여 구별되어 호출할 수 있다.
//	이것을 메소드 오버로드라고 한다.
	
//	(3) 키워드 this는 무엇을 가리키는가?
//	this는 클래스 내에서 자기 자신의 멤버를 호출할 때 쓰인다.
	
//	(4) 정적 변수와 인스턴스 변수의 차이점은 무엇인가?
//	객체가 생성된 이후에 메모리가 할당되는 인스턴스 변수와는 달리,
//	정적(static) 변수는 클래스 선언시 곧바로, 인스턴스와는 별도의 공간에 메모리가 할당된다.
	
//	(5) 객체가 매개 변수로 전달될 때는 어떤 값이 전달되는가?
//	객체의 참조변수값을 인수로 받아 메소드 실행 중 매개변수로 치환한다.
//	따라서 메소드가 종료되어 매개변수가 사라지더라도,
//	참조한 인스턴스의 값이 변경된다면 변경사항이 그대로 저장된다.
	
//	(6) 왜 정적 메소드는 인스턴스 변수를 참조할 수 없는가?
//	인스턴스 변수는 객체가 생성된 이후에 메모리가 할당되기 때문에,
//	클래스가 선언되자마자 메모리가 할당되는 정적 메소드는 인스턴스 변수를 쓸 수 없다.

}
